/*task 1 
Написати функцію pow(x,y) яка буде приймати 2 цисла, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.

Наприклад pow(2,3) функція поверне значення 8.

Умови виконання ДЗ

Не використовувати **
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будьякі підказки */


function pow(x, y) {
    let result = 1; // Начальное значение для результата

    // Если степень отрицательная, делаем инверсию
    if (y < 0) {
        x = 1 / x;
        y = -y;
    }

    // Цикл умножения x на себя y раз
    for (let i = 0; i < y; i++) {
        result *= x;
    }

    return result;
}
console.log (pow (2, 3));



/*task 2
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".

Якось так:

drawTriangle(5, *);

*

**

***

****

*****

Умови виконання ДЗ

Домашню роботу необхідно зробити двома способами
В задачі не потрібно використовувати prompt або щось інше пов'язане з UI
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки    */

function drawTriangle(height, symbol) {
    for (let i = 1; i <= height; i++) {
        console.log(symbol.repeat(i));
    }
}
drawTriangle(5, '*');