/* task 1: Напиши функцію bmiCategory (ми їх не проходили, можно полотном просто, замість аргументів функцій можна 
просто використати змінні), яка приймає вагу в кілограмах і зріст у метрах, розраховує індекс маси тіла (ІМТ), і виводить 
категорію ІМТ за цим значенням:
ІМТ < 18.5: "Недостатня вага"
18.5 <= ІМТ < 24.9: "Нормальна вага"
25 <= ІМТ < 29.9: "Надлишкова вага"
ІМТ >= 30: "Ожиріння" */

// Змінні для ваги і зросту
const weight = 60; // вага в кілограмах
const height = 1.60; // зріст у метрах

// Розрахунок ІМТ
const bmi = weight / (height * height);

// Визначення категорії ІМТ
let category;

if (bmi < 18.5) {
    category = "Недостатня вага";
} else if (bmi >= 18.5 && bmi < 24.9) {
    category = "Нормальна вага";
} else if (bmi >= 25 && bmi < 29.9) {
    category = "Надлишкова вага";
} else {
    category = "Ожиріння";
}

console.log("ІМТ:", bmi.toFixed(2));
console.log("Категорія:", category);





/* task 2: Напиши функцію triangleType, яка приймає довжини трьох сторін трикутника (a, b, c) і виводить у консоль, який це тип трикутника:

Якщо всі три сторони рівні, це рівносторонній трикутник.
Якщо дві сторони рівні, це рівнобедрений трикутник.
Якщо всі сторони різні, це різносторонній трикутник.
Якщо сторони не можуть утворити трикутник (тобто не виконуються умови трикутника), вивести повідомлення "Це не трикутник".

Умови трикутника: для будь-яких трьох сторін a, b, c повинно виконуватися:

a+b>c
a+c>b
b+c>a */

const a = 5;
const b = 5;
const c = 5;
triangleType(a, b, c);

function triangleType(a, b, c) {
    // Проверка условий треугольника
    if (a+b>c && a+c>b && b+c>a) {
    
    // Определение типа треугольника
    if (a === b && b === c) {
        console.log("Це рівносторонній трикутник");
    } else if (a === b || a === c || b === c) {
        console.log("Це рівнобедрений трикутник");
    } else {
        console.log("Це різносторонній трикутник");
    }
}
else {console.log("Це не трикутник");}

}